#### ConicalSurface Members

---

|  |
| --- |
| ConicalSurface Class   Methods   Properties   See Also |

The  ConicalSurface  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a conical surface defined by a local reference frame and a half angle. |
| Public method | Dispose | (Inherited from  Surface  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from  Surface  .) |
| Public method | GetFrameOfReference | Returns frame of reference associated with this ConicalSurface. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsValidConeAngle | Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2. |
| Public method | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Axis | Axis of the cone. This is the Z axis of the local coordinate system associated with this cone. |
| Public property | HalfAngle | Cone angle. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Surface  .) |
| Public property | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. (Inherited from  Surface  .) |
| Public property | Origin | Apex of the cone. This is the origin of the local coordinate system associated with this cone. |
| Public property | XDir | X axis of the local coordinate system associated with this cone. |
| Public property | YDir | X axis of the local coordinate system associated with this cone. |

# See Also

ConicalSurface Class

Autodesk.Revit.DB Namespace